<template>
  <div style="height: 800px;">
    <post-list :posts="postList" is-check="true"></post-list>
  </div>
</template>

<script>
import PostList from '@/components/PostList'

export default {
  name: 'PostCheck',
  components: {PostList},
  data(){
    return{
      searchPostName: '',
      tag:'',
      postList:[{
        cover: "https://fuss10.elemecdn.com/e/5d/4a731a90594a4af544c0c25941171jpeg.jpeg",
        name: "测试帖",
        show: false,
        like: 5,
        dislike: 2,
        newComment:{
          content:"",
        },
        comments: [
          {
            content:"说的太好了!!!!",
            comment_id:"",
            user_name:"蒋博文",
            time:"2023-4-10",
            user_avatar:"https://fuss10.elemecdn.com/e/5d/4a731a90594a4af544c0c25941171jpeg.jpeg",
          }
        ],
        content:"经常有同学给校园中的猫咪们投喂猫条、火腿肠、面包等食物，更有甚者还在猫粮碗中放烧烤和剩饭。殊不知很多人类喜欢吃的食物猫猫并不喜欢，还会对猫咪的健康产生危害。\n" +
            "\n" +
            "人类是杂食动物，而猫是纯粹的肉食动物，人类和猫的食谱并不一样。可能猫咪在人类社会的高融入度让很多人产生了错觉，但请记住，人猫有别，不要让一厢情愿的“爱”害了猫猫。\n" +
            "\n" +
            "\n" +
            "\n" +
            "如果要投喂猫猫，请准备猫粮、冻干或主食罐头，千万不要喂猫咪人类的食物！！！"+
            "\n" +
            "经常有同学给校园中的猫咪们投喂猫条、火腿肠、面包等食物，更有甚者还在猫粮碗中放烧烤和剩饭。殊不知很多人类喜欢吃的食物猫猫并不喜欢，还会对猫咪的健康产生危害。\n" +
            "\n" +
            "人类是杂食动物，而猫是纯粹的肉食动物，人类和猫的食谱并不一样。可能猫咪在人类社会的高融入度让很多人产生了错觉，但请记住，人猫有别，不要让一厢情愿的“爱”害了猫猫。\n" +
            "\n" +
            "\n" +
            "\n" +
            "如果要投喂猫猫，请准备猫粮、冻干或主食罐头，千万不要喂猫咪人类的食物！！！"+
            "\n" +
            "经常有同学给校园中的猫咪们投喂猫条、火腿肠、面包等食物，更有甚者还在猫粮碗中放烧烤和剩饭。殊不知很多人类喜欢吃的食物猫猫并不喜欢，还会对猫咪的健康产生危害。\n" +
            "\n" +
            "人类是杂食动物，而猫是纯粹的肉食动物，人类和猫的食谱并不一样。可能猫咪在人类社会的高融入度让很多人产生了错觉，但请记住，人猫有别，不要让一厢情愿的“爱”害了猫猫。\n" +
            "\n" +
            "\n" +
            "\n" +
            "如果要投喂猫猫，请准备猫粮、冻干或主食罐头，千万不要喂猫咪人类的食物！！！"+
            "\n" +
            "经常有同学给校园中的猫咪们投喂猫条、火腿肠、面包等食物，更有甚者还在猫粮碗中放烧烤和剩饭。殊不知很多人类喜欢吃的食物猫猫并不喜欢，还会对猫咪的健康产生危害。\n" +
            "\n" +
            "人类是杂食动物，而猫是纯粹的肉食动物，人类和猫的食谱并不一样。可能猫咪在人类社会的高融入度让很多人产生了错觉，但请记住，人猫有别，不要让一厢情愿的“爱”害了猫猫。\n" +
            "\n" +
            "\n" +
            "\n" +
            "如果要投喂猫猫，请准备猫粮、冻干或主食罐头，千万不要喂猫咪人类的食物！！！"
      }]
    }
  }
}
</script>

<style scoped>

</style>
